Masmiseim36/nxpSDK/devices/MKE15Z7/drivers/fsl_tsi_v5.h
/*!
 * @brief TSI SSC output bit0's period setting(SSC0[CHARGE_NUM])
 *
 * These bits set the SSC output bit0's period setting.
 */
typedef enum _tsi_ssc_charge_num
{
    kTSI_SscChargeNumValue_1  = 0U,  /*!< The SSC output bit 0's period will be 1  clock cycle of system clock. */
    kTSI_SscChargeNumValue_2  = 1U,  /*!< The SSC output bit 0's period will be 2  clock cycle of system clock. */
    kTSI_SscChargeNumValue_3  = 2U,  /*!< The SSC output bit 0's period will be 3  clock cycle of system clock. */
    kTSI_SscChargeNumValue_4  = 3U,  /*!< The SSC output bit 0's period will be 4  clock cycle of system clock. */
    kTSI_SscChargeNumValue_5  = 4U,  /*!< The SSC output bit 0's period will be 5  clock cycle of system clock. */
    kTSI_SscChargeNumValue_6  = 5U,  /*!< The SSC output bit 0's period will be 6  clock cycle of system clock. */
    kTSI_SscChargeNumValue_7  = 6U,  /*!< The SSC output bit 0's period will be 7  clock cycle of system clock. */
    kTSI_SscChargeNumValue_8  = 7U,  /*!< The SSC output bit 0's period will be 8  clock cycle of system clock. */
    kTSI_SscChargeNumValue_9  = 8U,  /*!< The SSC output bit 0's period will be 9  clock cycle of system clock. */
    kTSI_SscChargeNumValue_10 = 9U,  /*!< The SSC output bit 0's period will be 10 clock cycle of system clock. */
    kTSI_SscChargeNumValue_11 = 10U, /*!< The SSC output bit 0's period will be 11 clock cycle of system clock. */
    kTSI_SscChargeNumValue_12 = 11U, /*!< The SSC output bit 0's period will be 12 clock cycle of system clock. */
    kTSI_SscChargeNumValue_13 = 12U, /*!< The SSC output bit 0's period will be 13 clock cycle of system clock. */
    kTSI_SscChargeNumValue_14 = 13U, /*!< The SSC output bit 0's period will be 14 clock cycle of system clock. */
    kTSI_SscChargeNumValue_15 = 14U, /*!< The SSC output bit 0's period will be 15 clock cycle of system clock. */
    kTSI_SscChargeNumValue_16 = 15U, /*!< The SSC output bit 0's period will be 16 clock cycle of system clock. */
} tsi_ssc_charge_num_t;

/*!
 * @brief TSI SSC output bit1's period setting(SSC0[BASE_NOCHARGE_NUM])
 *
 * These bits set the SSC output bit1's period setting.
 */
typedef enum _tsi_ssc_nocharge_num
{
    kTSI_SscNoChargeNumValue_1 = 0U, /*!< The SSC output bit 1's basic period will be 1  clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_2 = 1U, /*!< The SSC output bit 1's basic period will be 2  clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_3 = 2U, /*!< The SSC output bit 1's basic period will be 3  clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_4 = 3U, /*!< The SSC output bit 1's basic period will be 4  clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_5 = 4U, /*!< The SSC output bit 1's basic period will be 5  clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_6 = 5U, /*!< The SSC output bit 1's basic period will be 6  clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_7 = 6U, /*!< The SSC output bit 1's basic period will be 7  clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_8 = 7U, /*!< The SSC output bit 1's basic period will be 8  clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_9 = 8U, /*!< The SSC output bit 1's basic period will be 9  clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_10 =
        9U, /*!< The SSC output bit 1's basic period will be 10 clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_11 =
        10U, /*!< The SSC output bit 1's basic period will be 11 clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_12 =
        11U, /*!< The SSC output bit 1's basic period will be 12 clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_13 =
        12U, /*!< The SSC output bit 1's basic period will be 13 clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_14 =
        13U, /*!< The SSC output bit 1's basic period will be 14 clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_15 =
        14U, /*!< The SSC output bit 1's basic period will be 15 clock cycle of system clock. */
    kTSI_SscNoChargeNumValue_16 =
        15U, /*!< The SSC output bit 1's basic period will be 16 clock cycle of system clock. */
} tsi_ssc_nocharge_num_t;

/*!
 * @brief TSI SSC outsel choosing the length of the PRBS (Pseudo-RandomBinarySequence) method
 * setting(SSC0[TSI_SSC0_PRBS_OUTSEL])
 *
 * These bits set the SSC PRBS length.
 */
typedef enum _tsi_ssc_prbs_outsel
{
    kTSI_SscPrbsOutsel_2  = 2U,  /*!< The length of the PRBS is 2. */
    kTSI_SscPrbsOutsel_3  = 3U,  /*!< The length of the PRBS is 3. */
    kTSI_SscPrbsOutsel_4  = 4U,  /*!< The length of the PRBS is 4. */
    kTSI_SscPrbsOutsel_5  = 5U,  /*!< The length of the PRBS is 5. */
    kTSI_SscPrbsOutsel_6  = 6U,  /*!< The length of the PRBS is 6. */
    kTSI_SscPrbsOutsel_7  = 7U,  /*!< The length of the PRBS is 7. */
    kTSI_SscPrbsOutsel_8  = 8U,  /*!< The length of the PRBS is 8. */
    kTSI_SscPrbsOutsel_9  = 9U,  /*!< The length of the PRBS is 9. */
    kTSI_SscPrbsOutsel_10 = 10U, /*!< The length of the PRBS is 10. */
    kTSI_SscPrbsOutsel_11 = 11U, /*!< The length of the PRBS is 11. */
    kTSI_SscPrbsOutsel_12 = 12U, /*!< The length of the PRBS is 12. */
    kTSI_SscPrbsOutsel_13 = 13U, /*!< The length of the PRBS is 13. */
    kTSI_SscPrbsOutsel_14 = 14U, /*!< The length of the PRBS is 14. */
    kTSI_SscPrbsOutsel_15 = 15U, /*!< The length of the PRBS is 15. */
} tsi_ssc_prbs_outsel_t;

/*! @brief TSI status flags. */
typedef enum _tsi_status_flags
{
    kTSI_EndOfScanFlag  = TSI_GENCS_EOSF_MASK,       /*!< End-Of-Scan flag */
    kTSI_OutOfRangeFlag = (int)TSI_GENCS_OUTRGF_MASK /*!< Out-Of-Range flag */
} tsi_status_flags_t;

/*! @brief TSI feature interrupt source.*/
typedef enum _tsi_interrupt_enable
{
    kTSI_GlobalInterruptEnable     = 1U, /*!< TSI module global interruptt */
    kTSI_OutOfRangeInterruptEnable = 2U, /*!< Out-Of-Range interrupt */
    kTSI_EndOfScanInterruptEnable  = 4U  /*!< End-Of-Scan interrupt */
} tsi_interrupt_enable_t;

/*!
 * @brief TSI SSC mode selection.
 *
 * These constants set the SSC mode.
 */
typedef enum _tsi_ssc_mode
{
    kTSI_ssc_prbs_method     = 0U, /*!< Using PRBS method generating SSC output bit. */
    kTSI_ssc_up_down_counter = 1U, /*!< Using up-down counter generating SSC output bit. */
    kTSI_ssc_dissable        = 2U, /*!< SSC function is disabled. */
} tsi_ssc_mode_t;

/*!
 * @brief TSI main clock selection.
 *
 * These constants set select the divider ratio for the clock used for generating the SSC output bit.
 */
typedef enum _tsi_ssc_prescaler
{
    kTSI_ssc_div_by_1   = 0x0U,  /*!< Set SSC divider to 00000000 div1(2^0) */
    kTSI_ssc_div_by_2   = 0x1U,  /*!< Set SSC divider to 00000001 div2(2^1) */
    kTSI_ssc_div_by_4   = 0x3U,  /*!< Set SSC divider to 00000011 div4(2^2) */
    kTSI_ssc_div_by_8   = 0x7U,  /*!< Set SSC divider to 00000111 div8(2^3) */
    kTSI_ssc_div_by_16  = 0xfU,  /*!< Set SSC divider to 00001111 div16(2^4) */
    kTSI_ssc_div_by_32  = 0x1fU, /*!< Set SSC divider to 00011111 div32(2^5) */
    kTSI_ssc_div_by_64  = 0x3fU, /*!< Set SSC divider to 00111111 div64(2^6) */
    kTSI_ssc_div_by_128 = 0x7fU, /*!< Set SSC divider to 01111111 div128(2^7) */
    kTSI_ssc_div_by_256 = 0xffU, /*!< Set SSC divider to 11111111 div256(2^8) */
} tsi_ssc_prescaler_t;

