Masmiseim36/nxpSDK/devices/MKE15Z7/drivers/fsl_tsi_v5.h
/*! @brief TSI calibration data storage. */
typedef struct _tsi_calibration_data
{
    uint16_t calibratedData[FSL_FEATURE_TSI_CHANNEL_COUNT]; /*!< TSI calibration data storage buffer */
} tsi_calibration_data_t;

/*!
 * @brief TSI common configuration structure
 *
 * This structure contains the common settings for TSI self-cap or mutual-cap mode, configurations including
 * the TSI module main clock, sensing mode, DVOLT options, SINC and SSC configurations.
 */
typedef struct _tsi_common_config
{
    tsi_main_clock_selection_t mainClock;   /*!< Set main clock. */
    tsi_sensing_mode_selection_t mode;      /*!< Choose sensing mode. */
    tsi_dvolt_option_t dvolt;               /*!< DVOLT option value.  */
    tsi_sinc_cutoff_div_t cutoff;           /*!< Cutoff divider.  */
    tsi_sinc_filter_order_t order;          /*!< SINC filter order. */
    tsi_sinc_decimation_value_t decimation; /*!< SINC decimation value. */
    tsi_ssc_charge_num_t chargeNum;         /*!< SSC High Width (t1), SSC output bit0's period setting. */
    tsi_ssc_prbs_outsel_t prbsOutsel;   /*!< SSC High Random Width (t2), length of PRBS(Pseudo-RandomBinarySequence),SSC
                                           output bit2's period setting. */
    tsi_ssc_nocharge_num_t noChargeNum; /*!< SSC Low Width (t3), SSC output bit1's period setting. */
    tsi_ssc_mode_t ssc_mode;            /*!< Clock mode selection (basic - from main clock by divider,advanced - using
                                           SSC(Switching Speed Clock) by three configurable intervals. */
    tsi_ssc_prescaler_t ssc_prescaler;  /*!< Set clock divider for basic mode. */
} tsi_common_config_t;

/*!
 * @brief TSI configuration structure for self-cap mode
 *
 * This structure contains the settings for the most common TSI self-cap configurations including
 * the TSI module charge currents, sensitivity configuration and so on.
 */
typedef struct _tsi_selfCap_config
{
    tsi_common_config_t commonConfig;            /*!< Common settings.          */
    bool enableSensitivity;                      /*!< Enable sensitivity boost of self-cap or not. */
    bool enableShield;                           /*!< Enable shield of self-cap mode or not. */
    tsi_sensitivity_xdn_option_t xdn;            /*!< Sensitivity XDN option.   */
    tsi_sensitivity_ctrim_option_t ctrim;        /*!< Sensitivity CTRIM option. */
    tsi_current_multiple_input_t inputCurrent;   /*!< Input current multiple.   */
    tsi_current_multiple_charge_t chargeCurrent; /*!< Charge/Discharge current multiple. */
} tsi_selfCap_config_t;

/*!
 * @brief TSI configuration structure for mutual-cap mode
 *
 * This structure contains the settings for the most common TSI mutual-cap configurations including
 * the TSI module generator settings, sensitivity related current settings and so on.
 */
typedef struct _tsi_mutualCap_config
{
    tsi_common_config_t commonConfig;                 /*!< Common settings.          */
    tsi_mutual_pre_current_t preCurrent;              /*!< Vref generator current.  */
    tsi_mutual_pre_resistor_t preResistor;            /*!< Vref generator resistor. */
    tsi_mutual_sense_resistor_t senseResistor;        /*!< I-sense generator resistor. */
    tsi_mutual_sense_boost_current_t boostCurrent;    /*!< Sensitivity boost current setting. */
    tsi_mutual_tx_drive_mode_t txDriveMode;           /*!< TX drive mode control setting. */
    tsi_mutual_pmos_current_left_t pmosLeftCurrent;   /*!< Pmos current mirror on the left side.  */
    tsi_mutual_pmos_current_right_t pmosRightCurrent; /*!< Pmos current mirror on the right side. */
    bool enableNmosMirror;                            /*!< Enable Nmos current mirror setting or not. */
    tsi_mutual_nmos_current_t nmosCurrent;            /*!< Nmos current mirror setting. */
} tsi_mutualCap_config_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif

/*!
 * @brief Initialize hardware to Self-cap mode.
 *
 * @details Initialize the peripheral to the targeted state specified by parameter config,
 *          such as sets sensitivity adjustment, current settings.
 * @param  base    TSI peripheral base address.
 * @param  config  Pointer to TSI self-cap configuration structure.
 * @return none
 */
void TSI_InitSelfCapMode(TSI_Type *base, const tsi_selfCap_config_t *config);

/*!
 * @brief Initialize hardware to Mutual-cap mode.
 *
 * @details Initialize the peripheral to the targeted state specified by parameter config,
 *          such as sets Vref generator setting, sensitivity boost settings, Pmos/Nmos settings.
 * @param  base    TSI peripheral base address.
 * @param  config  Pointer to TSI mutual-cap configuration structure.
 * @return none
 */
void TSI_InitMutualCapMode(TSI_Type *base, const tsi_mutualCap_config_t *config);

/*!
 * @brief De-initialize hardware.
 *
 * @details De-initialize the peripheral to default state.
 *
 * @param  base  TSI peripheral base address.
 * @return none
 */
void TSI_Deinit(TSI_Type *base);

/*!
 * @brief Get TSI self-cap mode user configure structure.
 * This interface sets userConfig structure to a default value. The configuration structure only
 * includes the settings for the whole TSI.
 * The user configure is set to a value:
 * @code
    userConfig->commonConfig.mainClock     = kTSI_MainClockSlection_0;
    userConfig->commonConfig.mode          = kTSI_SensingModeSlection_Self;
    userConfig->commonConfig.dvolt         = kTSI_DvoltOption_2;
    userConfig->commonConfig.cutoff        = kTSI_SincCutoffDiv_0;
    userConfig->commonConfig.order         = kTSI_SincFilterOrder_1;
    userConfig->commonConfig.decimation    = kTSI_SincDecimationValue_8;
    userConfig->commonConfig.chargeNum     = kTSI_SscChargeNumValue_3;
    userConfig->commonConfig.prbsOutsel    = kTSI_SscPrbsOutsel_2;
    userConfig->commonConfig.noChargeNum   = kTSI_SscNoChargeNumValue_2;
    userConfig->commonConfig.ssc_mode      = kTSI_ssc_prbs_method;
    userConfig->commonConfig.ssc_prescaler = kTSI_ssc_div_by_1;
    userConfig->enableSensitivity          = true;
    userConfig->enableShield               = false;
    userConfig->xdn                        = kTSI_SensitivityXdnOption_1;
    userConfig->ctrim                      = kTSI_SensitivityCtrimOption_7;
    userConfig->inputCurrent               = kTSI_CurrentMultipleInputValue_0;
    userConfig->chargeCurrent              = kTSI_CurrentMultipleChargeValue_1;
   @endcode
 *
 * @param userConfig Pointer to TSI user configure structure.
 */
void TSI_GetSelfCapModeDefaultConfig(tsi_selfCap_config_t *userConfig);

/*!
 * @brief Get TSI mutual-cap mode default user configure structure.
 * This interface sets userConfig structure to a default value. The configuration structure only
 * includes the settings for the whole TSI.
 * The user configure is set to a value:
 * @code
    userConfig->commonConfig.mainClock     = kTSI_MainClockSlection_1;
    userConfig->commonConfig.mode          = kTSI_SensingModeSlection_Mutual;
    userConfig->commonConfig.dvolt         = kTSI_DvoltOption_0;
    userConfig->commonConfig.cutoff        = kTSI_SincCutoffDiv_0;
    userConfig->commonConfig.order         = kTSI_SincFilterOrder_1;
    userConfig->commonConfig.decimation    = kTSI_SincDecimationValue_8;
    userConfig->commonConfig.chargeNum     = kTSI_SscChargeNumValue_4;
    userConfig->commonConfig.prbsOutsel    = kTSI_SscPrbsOutsel_2;
    userConfig->commonConfig.noChargeNum   = kTSI_SscNoChargeNumValue_5;
    userConfig->commonConfig.ssc_mode      = kTSI_ssc_prbs_method;
    userConfig->commonConfig.ssc_prescaler = kTSI_ssc_div_by_1;
    userConfig->preCurrent                 = kTSI_MutualPreCurrent_4uA;
    userConfig->preResistor                = kTSI_MutualPreResistor_4k;
    userConfig->senseResistor              = kTSI_MutualSenseResistor_10k;
    userConfig->boostCurrent               = kTSI_MutualSenseBoostCurrent_0uA;
    userConfig->txDriveMode                = kTSI_MutualTxDriveModeOption_0;
    userConfig->pmosLeftCurrent            = kTSI_MutualPmosCurrentMirrorLeft_32;
    userConfig->pmosRightCurrent           = kTSI_MutualPmosCurrentMirrorRight_1;
    userConfig->enableNmosMirror           = true;
    userConfig->nmosCurrent                = kTSI_MutualNmosCurrentMirror_1;
   @endcode
 *
 * @param userConfig Pointer to TSI user configure structure.
 */
void TSI_GetMutualCapModeDefaultConfig(tsi_mutualCap_config_t *userConfig);

/*!
 * @brief Hardware base counter value for calibration.
 *
 * @details Calibrate the peripheral to fetch the initial counter value of
 *          the enabled channels.
 *          This API is mostly used at initial application setup, it shall be called
 *          after the TSI_Init API, then user can use the calibrated
 *          counter values to setup applications(such as to determine
 *          under which counter value we can confirm a touch event occurrs).
 *
 * @param   base    TSI peripheral base address.
 * @param   calBuff Data buffer that store the calibrated counter value.
 * @return  none
 * @note    This API is mainly used for self-cap mode;
 * @note    The calibration work in mutual-cap mode shall be done in applications due to different board layout.
 *
 */
void TSI_SelfCapCalibrate(TSI_Type *base, tsi_calibration_data_t *calBuff);

/*!
 * @brief Enables TSI interrupt requests.
 * @param base TSI peripheral base address.
 * @param mask interrupt source
 *     The parameter can be combination of the following source if defined:
 *     @arg kTSI_GlobalInterruptEnable
 *     @arg kTSI_EndOfScanInterruptEnable
 *     @arg kTSI_OutOfRangeInterruptEnable
 */
void TSI_EnableInterrupts(TSI_Type *base, uint32_t mask);

/*!
 * @brief Disables TSI interrupt requests.
 * @param base TSI peripheral base address.
 * @param mask interrupt source
 *     The parameter can be combination of the following source if defined:
 *     @arg kTSI_GlobalInterruptEnable
 *     @arg kTSI_EndOfScanInterruptEnable
 *     @arg kTSI_OutOfRangeInterruptEnable
 */
void TSI_DisableInterrupts(TSI_Type *base, uint32_t mask);

/*!
 * @brief Get interrupt flag.
 * This function get tsi interrupt flags.
 *
 * @param    base  TSI peripheral base address.
 * @return         The mask of these status flags combination.
 */
static inline uint32_t TSI_GetStatusFlags(TSI_Type *base)
{
    return (base->GENCS & (uint32_t)((uint32_t)kTSI_EndOfScanFlag | (uint32_t)kTSI_OutOfRangeFlag));
}

/*!
 * @brief Clear interrupt flag.
 *
 * This function clear tsi interrupt flag,
 * automatically cleared flags can not be cleared by this function.
 *
 * @param base TSI peripheral base address.
 * @param mask The status flags to clear.
 */
void TSI_ClearStatusFlags(TSI_Type *base, uint32_t mask);

/*!
 * @brief Get TSI scan trigger mode.
 *
 * @param  base  TSI peripheral base address.
 * @return       Scan trigger mode.
 */
static inline uint32_t TSI_GetScanTriggerMode(TSI_Type *base)
{
    return (base->GENCS & TSI_GENCS_STM_MASK);
}

/*!
 * @brief Get scan in progress flag.
 *
 * @param    base TSI peripheral base address.
 * @return   True  - scan is in progress.
 *           False - scan is not in progress.
 */
static inline bool TSI_IsScanInProgress(TSI_Type *base)
{
    return (bool)(base->GENCS & TSI_GENCS_SCNIP_MASK);
}

/*!
 * @brief Enables the TSI Module or not.
 *
 * @param   base   TSI peripheral base address.
 * @param   enable Choose whether to enable or disable module;
 *                 - true   Enable TSI module;
 *                 - false  Disable TSI module;
 * @return  none.
 */
static inline void TSI_EnableModule(TSI_Type *base, bool enable)
{
    if (enable)
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) | TSI_GENCS_TSIEN_MASK; /* Enable module */
    }
    else
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) & (~TSI_GENCS_TSIEN_MASK); /* Disable module */
    }
}

/*!
 * @brief Sets the TSI low power STOP mode enable or not.
 *        This enables TSI module function in low power modes.
 *
 * @param    base    TSI peripheral base address.
 * @param    enable  Choose to enable or disable STOP mode.
 *                   - true   Enable module in STOP mode;
 *                   - false  Disable module in STOP mode;
 * @return   none.
 */
static inline void TSI_EnableLowPower(TSI_Type *base, bool enable)
{
    if (enable)
    {
        base->GENCS =
            (base->GENCS & ~ALL_FLAGS_MASK) | TSI_GENCS_STPE_MASK; /* Module enabled in low power stop modes */
    }
    else
    {
        base->GENCS =
            (base->GENCS & ~ALL_FLAGS_MASK) & (~TSI_GENCS_STPE_MASK); /* Module disabled in low power stop modes */
    }
}

/*!
 * @brief Enable the hardware trigger scan or not.
 *
 * @param    base TSI peripheral base address.
 * @param    enable Choose to enable hardware trigger or software trigger scan.
 *                  - true    Enable hardware trigger scan;
 *                  - false   Enable software trigger scan;
 * @return   none.
 */
static inline void TSI_EnableHardwareTriggerScan(TSI_Type *base, bool enable)
{
    if (enable)
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) | TSI_GENCS_STM_MASK; /* Enable hardware trigger scan */
    }
    else
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) & (~TSI_GENCS_STM_MASK); /* Enable software trigger scan */
    }
}

/*!
 * @brief Start one sotware trigger measurement (trigger a new measurement).
 *
 * @param    base TSI peripheral base address.
 * @return   none.
 */
static inline void TSI_StartSoftwareTrigger(TSI_Type *base)
{
    base->DATA |= TSI_DATA_SWTS_MASK;
}

/*!
 * @brief Set the measured channel number for self-cap mode.
 *
 * @param    base    TSI peripheral base address.
 * @param    channel Channel number 0 ... 24.
 * @return   none.
 * @note     This API can only be used in self-cap mode!
 */
static inline void TSI_SetSelfCapMeasuredChannel(TSI_Type *base, uint8_t channel)
{
    assert(channel < (uint8_t)FSL_FEATURE_TSI_CHANNEL_COUNT);

    base->DATA = ((base->DATA) & ~TSI_DATA_TSICH_MASK) | (TSI_DATA_TSICH(channel));
}

/*!
 * @brief Get the current measured channel number, in self-cap mode.
 *
 * @param    base    TSI peripheral base address.
 * @return   uint8_t    Channel number 0 ... 24.
 * @note     This API can only be used in self-cap mode!
 */
static inline uint8_t TSI_GetSelfCapMeasuredChannel(TSI_Type *base)
{
    return (uint8_t)((base->DATA & TSI_DATA_TSICH_MASK) >> TSI_DATA_TSICH_SHIFT);
}

/*!
 * @brief Enable DMA transfer or not.
 *
 * @param   base   TSI peripheral base address.
 * @param   enable Choose to enable DMA transfer or not.
 *                 - true    Enable DMA transfer;
 *                 - false   Disable DMA transfer;
 * @return  none.
 */
static inline void TSI_EnableDmaTransfer(TSI_Type *base, bool enable)
{
    if (enable)
    {
        base->DATA |= TSI_DATA_DMAEN_MASK; /* Enable DMA transfer */
    }
    else
    {
        base->DATA &= ~TSI_DATA_DMAEN_MASK; /* Disable DMA transfer */
    }
}

#if defined(FSL_FEATURE_TSI_HAS_END_OF_SCAN_DMA_ENABLE) && (FSL_FEATURE_TSI_HAS_END_OF_SCAN_DMA_ENABLE == 1)
/*!
 * @brief Decide whether to enable End of Scan DMA transfer request only.
 *
 * @param    base TSI peripheral base address.
 * @param    enable  Choose whether to enable End of Scan DMA transfer request only.
 *                   - true  Enable End of Scan DMA transfer request only;
 *                   - false Both End-of-Scan and Out-of-Range can generate DMA transfer request.
 * @return   none.
 */
static inline void TSI_EnableEndOfScanDmaTransferOnly(TSI_Type *base, bool enable)
{
    if (enable)
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) |
                      TSI_GENCS_EOSDMEO_MASK; /* Enable End of Scan DMA transfer request only; */
    }
    else
    {
        base->GENCS = (base->GENCS & ~ALL_FLAGS_MASK) &
                      (~TSI_GENCS_EOSDMEO_MASK); /* Both types of events can generate DMA transfer request. */
    }
}
#endif /* End of (FSL_FEATURE_TSI_HAS_END_OF_SCAN_DMA_ENABLE == 1)*/

/*!
 * @brief Gets the conversion counter value.
 *
 * @param    base TSI peripheral base address.
 * @return   Accumulated scan counter value ticked by the reference clock.
 */
static inline uint16_t TSI_GetCounter(TSI_Type *base)
{
    return (uint16_t)(base->DATA & TSI_DATA_TSICNT_MASK);
}

/*!
 * @brief Set the TSI wake-up channel low threshold.
 *
 * @param    base           TSI peripheral base address.
 * @param    low_threshold  Low counter threshold.
 * @return   none.
 */
static inline void TSI_SetLowThreshold(TSI_Type *base, uint16_t low_threshold)
{
    base->TSHD = ((base->TSHD) & ~TSI_TSHD_THRESL_MASK) | (TSI_TSHD_THRESL(low_threshold));
}

/*!
 * @brief Set the TSI wake-up channel high threshold.
 *
 * @param    base            TSI peripheral base address.
 * @param    high_threshold  High counter threshold.
 * @return   none.
 */
static inline void TSI_SetHighThreshold(TSI_Type *base, uint16_t high_threshold)
{
    base->TSHD = ((base->TSHD) & ~TSI_TSHD_THRESH_MASK) | (TSI_TSHD_THRESH(high_threshold));
}

/*!
 * @brief Set the main clock of the TSI module.
 *
 * @param    base   TSI peripheral base address.
 * @param    mainClock   clock option value.
 * @return   none.
 */
static inline void TSI_SetMainClock(TSI_Type *base, tsi_main_clock_selection_t mainClock)
{
    base->MODE = ((base->MODE) & ~TSI_MODE_SETCLK_MASK) | (TSI_MODE_SETCLK(mainClock));
}

/*!
 * @brief Set the sensing mode of the TSI module.
 *
 * @param    base   TSI peripheral base address.
 * @param    mode   Mode value.
 * @return   none.
 */
static inline void TSI_SetSensingMode(TSI_Type *base, tsi_sensing_mode_selection_t mode)
{
    base->MODE = ((base->MODE) & ~TSI_MODE_MODE_MASK) | (TSI_MODE_MODE(mode));
}

/*!
 * @brief Get the sensing mode of the TSI module.
 *
 * @param    base   TSI peripheral base address.
 * @return   Currently selected sensing mode.
 */
static inline tsi_sensing_mode_selection_t TSI_GetSensingMode(TSI_Type *base)
{
    return (tsi_sensing_mode_selection_t)(uint32_t)((base->MODE & TSI_MODE_MODE_MASK) >> TSI_MODE_MODE_SHIFT);
}

/*!
 * @brief Set the DVOLT settings.
 *
 * @param    base    TSI peripheral base address.
 * @param    dvolt   The voltage rails.
 * @return   none.
 */
static inline void TSI_SetDvolt(TSI_Type *base, tsi_dvolt_option_t dvolt)
{
    base->GENCS = (base->GENCS & ~(TSI_GENCS_DVOLT_MASK | ALL_FLAGS_MASK)) | (TSI_GENCS_DVOLT(dvolt));
}

/*!
 * @brief Enable self-cap mode noise cancellation function or not.
 *
 * @param    base                TSI peripheral base address.
 * @param    enableCancellation  Choose whether to enable noise cancellation in self-cap mode
 *                               - true  Enable noise cancellation;
 *                               - false Disable noise cancellation;
 * @return   none.
 */
static inline void TSI_EnableNoiseCancellation(TSI_Type *base, bool enableCancellation)
{
    base->MODE = ((base->MODE) & ~TSI_MODE_S_NOISE_MASK) | (TSI_MODE_S_NOISE(enableCancellation));
}

/*!
 * @brief Set the mutual-cap mode TX channel.
 *
 * @param    base       TSI peripheral base address.
 * @param    txChannel  Mutual-cap mode TX channel number
 * @return   none.
 */
static inline void TSI_SetMutualCapTxChannel(TSI_Type *base, tsi_mutual_tx_channel_t txChannel)
{
    base->MUL0 = ((base->MUL0) & ~TSI_MUL0_M_SEL_TX_MASK) | (TSI_MUL0_M_SEL_TX(txChannel));
}

/*!
 * @brief Get the current measured TX channel number, in mutual-cap mode.
 *
 * @param    base    TSI peripheral base address;
 * @return           Tx Channel number 0 ... 5;
 * @note     This API can only be used in mutual-cap mode!
 */
static inline tsi_mutual_tx_channel_t TSI_GetTxMutualCapMeasuredChannel(TSI_Type *base)
{
    return (tsi_mutual_tx_channel_t)(uint32_t)((base->MUL0 & TSI_MUL0_M_SEL_TX_MASK) >> TSI_MUL0_M_SEL_TX_SHIFT);
}

/*!
 * @brief Set the mutual-cap mode RX channel.
 *
 * @param    base       TSI peripheral base address.
 * @param    rxChannel  Mutual-cap mode RX channel number
 * @return   none.
 */
static inline void TSI_SetMutualCapRxChannel(TSI_Type *base, tsi_mutual_rx_channel_t rxChannel)
{
    base->MUL0 = ((base->MUL0) & ~TSI_MUL0_M_SEL_RX_MASK) | (TSI_MUL0_M_SEL_RX(rxChannel));
}

/*!
 * @brief Get the current measured RX channel number, in mutual-cap mode.
 *
 * @param    base    TSI peripheral base address;
 * @return           Rx Channel number 6 ... 11;
 * @note     This API can only be used in mutual-cap mode!
 */
static inline tsi_mutual_rx_channel_t TSI_GetRxMutualCapMeasuredChannel(TSI_Type *base)
{
    return (tsi_mutual_rx_channel_t)(uint32_t)((base->MUL0 & TSI_MUL0_M_SEL_RX_MASK) >> TSI_MUL0_M_SEL_RX_SHIFT);
}

/*!
 * @brief Set the SSC clock mode of the TSI module.
 *
 * @param    base   TSI peripheral base address.
 * @param    mode   SSC mode option value.
 * @return   none.
 */
static inline void TSI_SetSscMode(TSI_Type *base, tsi_ssc_mode_t mode)
{
    base->SSC0 = ((base->SSC0) & ~TSI_SSC0_SSC_MODE_MASK) | (TSI_SSC0_SSC_MODE(mode));
}

/*!
 * @brief Set the SSC prescaler of the TSI module.
 *
 * @param    base   TSI peripheral base address.
 * @param    prescaler  SSC prescaler option value.
 * @return   none.
 */
static inline void TSI_SetSscPrescaler(TSI_Type *base, tsi_ssc_prescaler_t prescaler)
{
    base->SSC0 = ((base->SSC0) & ~TSI_SSC0_SSC_PRESCALE_NUM_MASK) | (TSI_SSC0_SSC_PRESCALE_NUM(prescaler));
}

#if (defined(FSL_FEATURE_TSI_HAS_M_TX_USED) && FSL_FEATURE_TSI_HAS_M_TX_USED)
/*!
 * @brief Set used mutual-cap TX channel.
 *
 * @param    base       TSI peripheral base address.
 * @param    txChannel  Mutual-cap mode TX channel number
 * @return   none.
 */
static inline void TSI_SetUsedTxChannel(TSI_Type *base, tsi_mutual_tx_channel_t txChannel)
{
    base->MUL0 = (base->MUL0) | (TSI_MUL0_M_TX_USED(1U << txChannel));
}

/*!
 * @brief Clear used mutual-cap TX channel.
 *
 * @param    base       TSI peripheral base address.
 * @param    txChannel  Mutual-cap mode TX channel number
 * @return   none.
 */
static inline void TSI_ClearUsedTxChannel(TSI_Type *base, tsi_mutual_tx_channel_t txChannel)
{
    base->MUL0 &= ~TSI_MUL0_M_TX_USED(1U << txChannel);
}
#endif

#ifdef __cplusplus
}
#endif /* __cplusplus */

/*! @}*/

#endif /* _FSL_TSI_V5_H_ */
